src/test/jmeter/jmeter-reports/pets/html/statistics.json
{
  "DELETE /vets/{id}" : {
    "transaction" : "DELETE /vets/{id}",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 108.44999999999997,
    "medianResTime" : 87.0,
    "minResTime" : 75.0,
    "maxResTime" : 196.0,
    "pct1ResTime" : 171.39999999999998,
    "pct2ResTime" : 177.89999999999998,
    "pct3ResTime" : 196.0,
    "throughput" : 0.9199490961500131,
    "receivedKBytesPerSec" : 0.32431799190444793,
    "sentKBytesPerSec" : 0.2267979973858113
  },
  "GET /pets (auth)" : {
    "transaction" : "GET /pets (auth)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 103.0,
    "medianResTime" : 103.0,
    "minResTime" : 103.0,
    "maxResTime" : 103.0,
    "pct1ResTime" : 103.0,
    "pct2ResTime" : 103.0,
    "pct3ResTime" : 103.0,
    "throughput" : 9.70873786407767,
    "receivedKBytesPerSec" : 19.294220266990294,
    "sentKBytesPerSec" : 2.1522299757281553
  },
  "PUT /vets/{id}" : {
    "transaction" : "PUT /vets/{id}",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 108.6666666666667,
    "medianResTime" : 86.0,
    "minResTime" : 75.0,
    "maxResTime" : 189.0,
    "pct1ResTime" : 159.6,
    "pct2ResTime" : 172.7,
    "pct3ResTime" : 189.0,
    "throughput" : 0.9193570629606361,
    "receivedKBytesPerSec" : 0.352839185296416,
    "sentKBytesPerSec" : 0.303369874584374
  },
  "GET /pets (unauth)" : {
    "transaction" : "GET /pets (unauth)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.0,
    "medianResTime" : 28.0,
    "minResTime" : 28.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 28.0,
    "throughput" : 35.714285714285715,
    "receivedKBytesPerSec" : 11.509486607142858,
    "sentKBytesPerSec" : 6.556919642857142
  },
  "GET /vets (list)" : {
    "transaction" : "GET /vets (list)",
    "sampleCount" : 140,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 110.34285714285716,
    "medianResTime" : 90.5,
    "minResTime" : 75.0,
    "maxResTime" : 218.0,
    "pct1ResTime" : 159.9,
    "pct2ResTime" : 175.95,
    "pct3ResTime" : 207.75000000000009,
    "throughput" : 2.0623112616925683,
    "receivedKBytesPerSec" : 2.1241259344847903,
    "sentKBytesPerSec" : 0.45717251601973924
  },
  "GET /pets/{id} (after delete)" : {
    "transaction" : "GET /pets/{id} (after delete)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 91.0,
    "medianResTime" : 91.0,
    "minResTime" : 91.0,
    "maxResTime" : 91.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 91.0,
    "pct3ResTime" : 91.0,
    "throughput" : 10.989010989010989,
    "receivedKBytesPerSec" : 4.0779532967032965,
    "sentKBytesPerSec" : 2.46823489010989
  },
  "GET /owners" : {
    "transaction" : "GET /owners",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.0,
    "medianResTime" : 83.0,
    "minResTime" : 83.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 83.0,
    "pct2ResTime" : 83.0,
    "pct3ResTime" : 83.0,
    "throughput" : 12.048192771084338,
    "receivedKBytesPerSec" : 39.439006024096386,
    "sentKBytesPerSec" : 2.694371234939759
  },
  "GET /pets/{id} (after update)" : {
    "transaction" : "GET /pets/{id} (after update)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 104.0,
    "medianResTime" : 104.0,
    "minResTime" : 104.0,
    "maxResTime" : 104.0,
    "pct1ResTime" : 104.0,
    "pct2ResTime" : 104.0,
    "pct3ResTime" : 104.0,
    "throughput" : 9.615384615384617,
    "receivedKBytesPerSec" : 5.061222956730769,
    "sentKBytesPerSec" : 2.1597055288461537
  },
  "GET /pets/{id}" : {
    "transaction" : "GET /pets/{id}",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 77.0,
    "medianResTime" : 77.0,
    "minResTime" : 77.0,
    "maxResTime" : 77.0,
    "pct1ResTime" : 77.0,
    "pct2ResTime" : 77.0,
    "pct3ResTime" : 77.0,
    "throughput" : 12.987012987012989,
    "receivedKBytesPerSec" : 6.747159090909091,
    "sentKBytesPerSec" : 2.9170048701298703
  },
  "GET /vets/{id}" : {
    "transaction" : "GET /vets/{id}",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 113.1,
    "medianResTime" : 87.5,
    "minResTime" : 74.0,
    "maxResTime" : 210.0,
    "pct1ResTime" : 176.6,
    "pct2ResTime" : 185.89999999999998,
    "pct3ResTime" : 210.0,
    "throughput" : 0.9232757824762257,
    "receivedKBytesPerSec" : 0.4476174435647678,
    "sentKBytesPerSec" : 0.20778213288246697
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 539,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.96474953617825,
    "medianResTime" : 91.0,
    "minResTime" : 28.0,
    "maxResTime" : 691.0,
    "pct1ResTime" : 167.0,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 197.0,
    "throughput" : 7.933704259766257,
    "receivedKBytesPerSec" : 8.167272572970944,
    "sentKBytesPerSec" : 1.9657169036474431
  },
  "PUT /pets/{id}" : {
    "transaction" : "PUT /pets/{id}",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.0,
    "medianResTime" : 83.0,
    "minResTime" : 83.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 83.0,
    "pct2ResTime" : 83.0,
    "pct3ResTime" : 83.0,
    "throughput" : 12.048192771084338,
    "receivedKBytesPerSec" : 4.6239646084337345,
    "sentKBytesPerSec" : 4.247458584337349
  },
  "POST /vets" : {
    "transaction" : "POST /vets",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.03333333333333,
    "medianResTime" : 90.5,
    "minResTime" : 75.0,
    "maxResTime" : 183.0,
    "pct1ResTime" : 171.8,
    "pct2ResTime" : 182.89999999999998,
    "pct3ResTime" : 183.0,
    "throughput" : 0.9208385769974523,
    "receivedKBytesPerSec" : 0.46842267066208293,
    "sentKBytesPerSec" : 0.2904598245802511
  },
  "POST /owners/1/pets" : {
    "transaction" : "POST /owners/1/pets",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 691.0,
    "medianResTime" : 691.0,
    "minResTime" : 691.0,
    "maxResTime" : 691.0,
    "pct1ResTime" : 691.0,
    "pct2ResTime" : 691.0,
    "pct3ResTime" : 691.0,
    "throughput" : 1.447178002894356,
    "receivedKBytesPerSec" : 0.785772431259045,
    "sentKBytesPerSec" : 0.49040113965267734
  },
  "GET /pets (read-only)" : {
    "transaction" : "GET /pets (read-only)",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 113.88666666666663,
    "medianResTime" : 96.5,
    "minResTime" : 77.0,
    "maxResTime" : 200.0,
    "pct1ResTime" : 167.0,
    "pct2ResTime" : 186.89999999999998,
    "pct3ResTime" : 198.47000000000003,
    "throughput" : 2.513699663164245,
    "receivedKBytesPerSec" : 5.003980679075964,
    "sentKBytesPerSec" : 0.5572361557991051
  },
  "DELETE /pets/{id}" : {
    "transaction" : "DELETE /pets/{id}",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.0,
    "medianResTime" : 83.0,
    "minResTime" : 83.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 83.0,
    "pct2ResTime" : 83.0,
    "pct3ResTime" : 83.0,
    "throughput" : 12.048192771084338,
    "receivedKBytesPerSec" : 4.247458584337349,
    "sentKBytesPerSec" : 2.964984939759036
  }
}