src/test/jmeter/jmeter-reports/pettypes-and-specialties-ana/html/statistics.json
{
  "PUT /pettypes/{petTypeId}" : {
    "transaction" : "PUT /pettypes/{petTypeId}",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.500000000000003,
    "medianResTime" : 7.0,
    "minResTime" : 5.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 11.449999999999996,
    "pct3ResTime" : 14.0,
    "throughput" : 0.9255488504683277,
    "receivedKBytesPerSec" : 0.3552155256191922,
    "sentKBytesPerSec" : 0.21146621978083005
  },
  "PUT /specialties/{specialtyId}" : {
    "transaction" : "PUT /specialties/{specialtyId}",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.660000000000004,
    "medianResTime" : 6.5,
    "minResTime" : 5.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 36.0,
    "throughput" : 0.9259430730198708,
    "receivedKBytesPerSec" : 0.3553668239226652,
    "sentKBytesPerSec" : 0.21602324232856163
  },
  "GET /pettypes (get all pettypes)" : {
    "transaction" : "GET /pettypes (get all pettypes)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.740000000000001,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 12.0,
    "throughput" : 0.9253775540420491,
    "receivedKBytesPerSec" : 0.54036988497557,
    "sentKBytesPerSec" : 0.12109432836097128
  },
  "GET /pettypes/{petTypeId}" : {
    "transaction" : "GET /pettypes/{petTypeId}",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.84,
    "medianResTime" : 4.5,
    "minResTime" : 3.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 10.0,
    "throughput" : 0.9254803242883056,
    "receivedKBytesPerSec" : 0.410284226576093,
    "sentKBytesPerSec" : 0.12378299337356087
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.7700000000000005,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 54.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 23.99000000000001,
    "throughput" : 9.230882841634974,
    "receivedKBytesPerSec" : 4.0893892732525945,
    "sentKBytesPerSec" : 1.7096784941199277
  },
  "GET /specialties (get all specialties)" : {
    "transaction" : "GET /specialties (get all specialties)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.800000000000001,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 7.899999999999999,
    "pct2ResTime" : 11.449999999999996,
    "pct3ResTime" : 21.0,
    "throughput" : 0.9258401999814833,
    "receivedKBytesPerSec" : 0.4917621921581335,
    "sentKBytesPerSec" : 0.12386729238033514
  },
  "GET /specialties/{specialtyId}" : {
    "transaction" : "GET /specialties/{specialtyId}",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.2600000000000025,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 9.349999999999987,
    "pct3ResTime" : 30.0,
    "throughput" : 0.9259259259259259,
    "receivedKBytesPerSec" : 0.4158528645833333,
    "sentKBytesPerSec" : 0.12650101273148148
  },
  "DELETE  /specialties/{specialtyId}" : {
    "transaction" : "DELETE  /specialties/{specialtyId}",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.620000000000003,
    "medianResTime" : 8.0,
    "minResTime" : 5.0,
    "maxResTime" : 32.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 15.14999999999997,
    "pct3ResTime" : 32.0,
    "throughput" : 0.9260459689218973,
    "receivedKBytesPerSec" : 0.3264673777156298,
    "sentKBytesPerSec" : 0.20429080505806307
  },
  "DELETE /pettypes/{petTypeId}" : {
    "transaction" : "DELETE /pettypes/{petTypeId}",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.899999999999999,
    "medianResTime" : 10.0,
    "minResTime" : 5.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 12.899999999999999,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 23.0,
    "throughput" : 0.9256173867969937,
    "receivedKBytesPerSec" : 0.326316285775112,
    "sentKBytesPerSec" : 0.20153872320337665
  },
  "POST /pettypes (create pettype)" : {
    "transaction" : "POST /pettypes (create pettype)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.88,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 54.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 15.749999999999936,
    "pct3ResTime" : 54.0,
    "throughput" : 0.9239070179977088,
    "receivedKBytesPerSec" : 0.4348137403451716,
    "sentKBytesPerSec" : 0.18947311892531135
  },
  "POST /specialties (create specialty)" : {
    "transaction" : "POST /specialties (create specialty)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.499999999999999,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 7.899999999999999,
    "pct2ResTime" : 8.449999999999996,
    "pct3ResTime" : 10.0,
    "throughput" : 0.925805914048179,
    "receivedKBytesPerSec" : 0.4437358814598108,
    "sentKBytesPerSec" : 0.19619129233247543
  }
}